content/MERCS-CV.md
+++
title = "Mercs Resume"
author = ["Sean Terrell"]
date = 2021-06-02T03:56:00-05:00
lastmod = 2021-06-02T05:52:57-05:00
draft = false
weight = 2003
noauthor = true
nocomment = true
nodate = true
nopaging = true
noread = true
sidemenu = true
[menu.main]
  weight = 2003
  identifier = "mercs-resume"
+++

**Sean Terrell**
238 West Tours Rd, Elm Mott, TX, 76640
337.522.9291
[terrellsm@gmail](mailto:terrellsm@gmail.com)

_**Work History and Experience**_


## **Sahoma Controlware, Edmond Ok** {#sahoma-controlware-edmond-ok}

-   **Co-Owner, Senior Project Engineer, Automation Consultant Aug 2020**
    -   Automation System Developer and Real Time system deployment engineer
    -   Designed and Implemented, Custom Node.js web SCADA, SahomaSCADA a, multi customer and multi-tenant web monitoring platform for critical systems.
    -   Built all container services and administrate all Kubernetes clusters and controllers implementing our system on a private cloud.
    -   Coordinated Sahoma Partnership with Codesys USA.
    -   Specialist in containerized, and Linux Run-Time executions for real time PLC controls.
    -   IIOT solution developer for Sahoma
    -   Developing Java implementation using windows-based IPC controllers executing TwinCat Run Time
    -   Bringing next gen solutions to the device ring. Developing a hardware based consensus model to verify sensor firmware integrity and using a sensor level value ledger with consensus for 0 trust sensor output verification
    -   OOIP programming guru. Implementation of Object-Oriented Industrial Programming using IEC 61131-3 IDE’s.
    -   Automation system programmer for multiple projects including Wago, PLCNext, Beckhoff, Allen Bradley, and Omron.


## **Cowan Consulting Services**, Midland TX {#cowan-consulting-services-midland-tx}

-   Multiple Positions and Roles filled from March 2019 - Aug 2020:
-   **SCADA Practice Lead and System Developer**
-   **Rockwell PLC Programing Lead, and OOIP Program developer.** <br />
    _Duties, Tasks, and Accomplishments_
    -   Primary designer and POC, for NodeJS and Node-Red based SCADA
        system for very large customer. Acted as the designer and
        assistant developer for a custom SCADA implementation written in
        Node and Vue
    -   Supported Web SCADA rebase from NodeJS to Ignition 8.0 with
        Perspective on cloud host for monthly paying customers,
    -   AWS cloud devops and deployment guru. Vast Linux and Unix /
        CentOS and Sun system admin experience. Comfortable with
        provisioning and securing assets as well as delivering data from
        RDS and Kinesis Streams.
    -   AWS IoT solution crafter, very experienced with OPC-UA, MQTT,
        SMS alarms and email management directly using Amazon MQ, Amazon
    -   Communications Expert and data access specialist. Recently
        built Unified Namespace and moved all Ignition incoming data to
        MQTT.
    -   Heavy Codesys user and Programmer. Highly skilled in Object
        Oriented Industrial Programming, easily able to adapt to codesys
        based products such as Bedrock, Wago, Eaton, ABB PLC's and more.
    -   Programmer for multiple construction projects including 100K BPD
        completely automated sites for major water midstream customer


## **The Integration Group of Americas {TIGA}**, Lafayette LA {#the-integration-group-of-americas-tiga-lafayette-la}

-   **Commissioning Engineer / Automation Technician** (Bakken), Sept 2017 -- May 2019 <br />
    _Duties, Tasks, and Accpmplishments_
    -   Supporting Statoil Bakken I&E Facilities and Midstream
        Facilities
    -   Supported multiple commissioning and facilities tasks as I&E
        team automation programmer.
    -   Wrote and supported multiple changes to C&E charts, P&ID's, and
        Control Narratives
    -   Coordinated and oversaw the application of field MOC's,
        directing the Instrumentation and Electricians to accomplish the
        necessary hardware changes while deploying and testing all
        automation programming changes.
    -   Lead Programmer and Developer for Midstream River Crossing Block
        Valve Sites. Developed the PLC Program and HMI, supported all
        Commissioning efforts
    -   June 2018 -- May 2019, Requested specifically by customer as
        full time Midstream Capital Project Programming and
        Commissioning Support
    -   Recently completed upgrade of control system at all ND and MT
        saltwater disposal sites. Upgraded from Micrologix 1400 and
        Siemens S71200 system to single Control Logix L62. Rolled out 10
        sites in 13 weeks, with an average of 4 days down time and all
        control system items complete.


## **Sirius Technologies**, Eunice LA {#sirius-technologies-eunice-la}

-   **SCADA / Automation Central Gulf Lead Technician**, June 2016--Sept 2017
    _Duties, Tasks, and Accomplishments_
    -   Internally promoted to ****lead automation technician**** in the field.
    -   Support, assist, and train junior technicians and measurement
        personnel.
    -   Act as the SME for all automation and SCADA systems for the
        entire Central Gulf for Energy XXI as well as support I&E
        efforts in the Western Gulf.


## **Sirius Technologies** {#sirius-technologies}

-   **SCADA / PLC Automation Technician**, August 2015 -- June 2016
    _Duties, Tasks, and Accomplishments_
    -   Energy XXI Grand Isle 16 Field SCADA Support Technician.
    -   Support all field platform including main GI22L and additional
        unmanned platforms. Additionally support Energy XXI assets in
        the West Delta and South Timbalier, Vermillion, and South Marsh
        Island blocks
    -   Installed and tested pressure and level sensors on multitude of
        Oil and Gas processing equipment and vessels. Familiar with
        autopilots and burner safety systems for fired vessels,
        automated control valves, radar, float, and DP tank level
        indications.
    -   Rebuilt and maintained a multitude of electrical and pneumatic
        control panels for well and pipeline operations, compressor
        controls, gas lift controls and safety system shut ins using
        Electronic over pneumatic and direct pneumatic automation.
    -   Installed, tested, calibrated, and maintained a multitude of
        flow measurement systems including ABB TotalFlow, ROC 800 and
        107, Fox Thermal Measurements and others.
    -   Built, Edited, supported and repaired SCADA system HMI displays
        using Wonderware, Ignition, and Factory Talk. Integrated new
        sensors into the existing SCADA system for monitoring and
        control.
    -   Installed and configured OPC server software and systems for
        historical data collection and SCADA monitoring and control.
    -   Programmed and maintained logic for a multitude of PLC and
        Controller types, including SCADAPack, Allen Bradley SLC500 and
        CompactLogix, Phoenix Contact, Direct Logic, ABB Total Flow,
        Siemens S5 and S7, TI Simatics, GE Fanuc, along with many
        Rosemount, Fischer, and ABB sensors.
    -   Installed tested and maintained many remote transmitters and
        mesh network radio components and antennas, including ABB
        Tropos, Free Wave, Phoenix Contact Radio Wireless, and Ubiquiti
        Networks.


## **Omega Natchiq**, New Iberia LA, {#omega-natchiq-new-iberia-la}

-   **Automation and Electrical installation tech**, April 2015 -- Auguest 2015
    _Duties, Tasks, and Accomplishments_
    -   Installed, tested, and commissioned cabling and junction boxes /
        terminal boards for new construction oil and gas production vessels,
        equipment, platforms and sites.Designed electrical and pneumatic panels
        for SCADA and Logic controls.
    -   Installed all cabling and terminated all wiring for variety of
        electronic and pneumatic controls and sensors including PLC, EFM,
        RTD, and other SAFE PSHL, LSHL, sensors per construction drawings
        and assembly diagrams.
    -   Installed all pneumatic tubing and instruments for various
        control panels, vessels, and equipment.


## **National Oilwell Varco** (NOV), New Iberia LA. {#national-oilwell-varco--nov--new-iberia-la-dot}

-   **Controls and Drilling Robotics Automatation Tech, Field Service** July 2014- March 2015
    _Duties, Tasks, and Accomplishments_
    -   Conducted repair, installation, and commissioning of Automated
        Drilling Control Systems for Amphion® and Cyberbase® land
        and offshore jack up drilling rigs.
    -   Performed all testing of entire controls systems verifying
        proper operation and alarms and lockouts.
    -   Oversaw, Operated, and Completed Installation of all Rig
        Cantileiver and Drilling Floor Equipment ensuring safe movement
        and operation of all tools. Adjusted PIDs' for proper tool
        alignment and safe hydraulic flow rates.
    -   Installed Siemens S7 Simatic PLC systems, Allen Bradley Control
        Logix and S5/05 systems. Troubleshot and repaired or replaced /
        adjusted and calibrated a multitude of PLC and Automation
        components including PLC's, VFD's, and all manner of field
        sensors.
    -   Chosen for an unsupported overseas assignment in Shekou China,
        conducting commissioning, based on technical expertise.


## **Trumpf GmBH**, Plymouth MI {#trumpf-gmbh-plymouth-mi}

-   **Field Service Engineer (Laser / laser Machines)** February 2013 -- July 2014
    _Duties, Tasks, and Accomplishments_
    -   Field Service and Integration Engineer for VectorMark / TruMark Marking Lasers
    -   Conduct in service machine engineering, repairs, maintenance,
        troubleshooting and repair at customers sites for lasers and
        laser machines
    -   Commission and integrate lasers into new manufacturing processes
        and provide technical assistance for integration and PLC
        programming.


## **Systems Engineering Associates Corp (SEACORP)**, Middletown RI {#systems-engineering-associates-corp--seacorp--middletown-ri}

-   **Test Engineer** March 2006 -- Nov 2012
    _Duties, Tasks, and Accomplishments_
    -   Top Secret Clarence for this Position maintained for over 5
        years (SSBI completed Oct of 2012)
    -   Wrote and Conducted test programs on tactical ship equipment,
        including shipboard computer systems and missile interface systems and controls
    -   Conducted onboard testing, operational verification, and repair of
        all onboard Tomahawk systems and communications for pre deploying
        submarines.
    -   Provided onsite installation and repairs for multiple Tomahawk
        Weapons System Hardware and Software systems.


### **Education and Certifications** {#education-and-certifications}

-   Current offshore training certificates, including IADC Rig Pass,
    BOSIET with HUET, Safe Gulf and Safe Land, Fire Fighting (Complete
    training at Well Control Houston), and Arc Flash safety for
    electricians, and More.
-   Completed NOV Tech College for Field Service Engineers. 12/10/2014
-   Siemens PLC Applications I and II
-   Allen Bradley PLC Applications for RSLogix 500
-   Completed TRUPMF Field Service Engineer TRUMark Level I and Level II
    in Grusch, Switzerland.
-   Competed U.S. Navy Submarine Basic AC/DC and Advanced Electronics,
    Fire Control Technician operation, U.S Navy Tactical Advanced
    Computer Systems Combined Maintenance School, Fire Control Systems
    Maintenance School. Completed Naval Leadership for E-5.


### **Personal Projects and Open Source DevOps** {#personal-projects-and-open-source-devops}

-   2009-2010 performed analysis and wrote engineering white paper and which led to the rebase of the AN/BYG-1 Combat Control System from HP-UX 11.11. The primary processing for the CCS was migrated to RHEL and the TTWS from 11.09 to Debian
-   2010 Heavily involved in community forums for Linux Mint, supported pre-alpha testing and hardware operability checks for LMDE, a project to rebase Mint onto Debian.
-   2018-2019 started the NODAK Automation Synergy Group – an open forum that met weekly in Williston to do Automation Training, PLC Programming, offer project assistance, and have IIoT and automation related talks and discussions
-   2020 - Supporting the Lora Alliance and things network registering several open Lora Gateways in the Permian.
-   2020 – Contributor to Unified Namespace project
-   2018-Present - Participated in Numerous interviews and podcast discussions focused on industrial automation
-   2021- Panelist / Presenter / Moderator for the Open Automation clubhouse.
-   WIP-Automation Mercs Podcast- Delivering High Quality Discussions and Demos of Automation Awesomeness.
